taskt/Core/Automation/Commands/WindowGroup/CloseWindowsCommand.puml
@startuml
CloseWindowsCommand --> AWindowNamesActionCommnads
AWindowNamesActionCommnads --> AWindowNamesCommands
AWindowNamesActionCommnads --> IWindowNamesActionProperties
AWindowNamesCommands --> AWindowNameCoreCommands
AWindowNamesCommands --> IWindowNamesProperties
AWindowNamesCommands --> ICanHandleList
AWindowNameCoreCommands --> ScriptCommand
AWindowNameCoreCommands --> IWindowNameCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
